Repository: MC-and-his-Agents/SkillsManager
Catalog: Sources/SkillsManager/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# %@ differs from the managed version.
source: %@ 与托管版本不同。
en: %@ differs from the managed version.

# %@ distribution
source: %@ 分发
en: %@ distribution

# %@ is already in the managed library.
source: %@ 已在托管库中。
en: %@ is already in the managed library.

# %@ is managed and available to the selected Agents.
source: %@ 已托管，可供所选 Agent 使用。
en: %@ is managed and available to the selected Agents.

# %@ is managed, but its Agent state must be confirmed.
source: %@ 已托管，但必须确认其 Agent 状态。
en: %@ is managed, but its Agent state must be confirmed.

# %@ is managed, but its distribution state must be confirmed or repaired.
source: %@ 已托管，但必须确认或修复其分发状态。
en: %@ is managed, but its distribution state must be confirmed or repaired.

# %@ is managed.
source: %@ 已托管。
en: %@ is managed.

# %@ is managed; no distribution changes were needed.
source: %@ 已托管；无需更改分发。
en: %@ is managed; no distribution changes were needed.

# %@ is managed; resolve its distribution conflict from details.
source: %@ 已托管；请从详情解决其分发冲突。
en: %@ is managed; resolve its distribution conflict from details.

# %@ is ready.
source: %@ 已准备就绪。
en: %@ is ready.

# %@ is safe in the managed library, but distribution was not applied.
source: %@ 在托管库中安全，但未应用分发。
en: %@ is safe in the managed library, but distribution was not applied.

# %@ was backed up and updated. Current Agent access was preserved.
source: %@ 已备份并更新。当前 Agent 访问保持不变。
en: %@ was backed up and updated. Current Agent access was preserved.

# %@ was updated and backed up. Refresh its distribution from details.
source: %@ 已更新并备份。请从详情刷新其分发。
en: %@ was updated and backed up. Refresh its distribution from details.

# %@ was updated.
source: %@ 已更新。
en: %@ was updated.

# %@, Available, Repository, %@, %@
source: %@，可用，仓库，%@，%@
en: %@, Available, Repository, %@, %@

# %@, Available, skills.sh, %lld installs, source %@
source: %@，可用，skills.sh，安装 %@ 次，来源 %@
en: %@, Available, skills.sh, %@ installs, source %@

# %@, Copy decision required
source: %@，需要决定 Copy 处理方式
en: %@, Copy decision required

# %@, checking for updates
source: %@，正在检查更新
en: %@, checking for updates

# %@, preparing update
source: %@，正在准备更新
en: %@, preparing update

# %@, update available
source: %@，有可用更新
en: %@, update available

# %@, updating
source: %@，正在更新
en: %@, updating

# %@, waiting
source: %@，正在等待
en: %@, waiting

# %lld Agents
source: %(count)lld 个 Agent
en: %(count)lld Agents

# %lld Skills
source: %lld 个技能
en: %lld Skills

# %lld candidates available
source: %lld 个候选项可用
en: %lld candidates available

# %lld candidates available · %lld selected
source: 有 %lld 个候选项 · 已选择 %lld
en: %lld candidates available · %lld selected

# %lld created · %lld claimed · %lld skipped · %lld failed
source: %lld 已创建 · %lld 已认领 · %lld 已跳过 · %lld 失败
en: %lld created · %lld claimed · %lld skipped · %lld failed

# %lld downloads
source: 下载 %lld 次
en: %lld downloads

# %lld installs
source: 安装 %lld 次
en: %lld installs

# %lld item(s) need review.
source: 有 %lld 项需要检查。
en: %lld item(s) need review.

# %lld of %lld
source: %1$lld 的 %2$lld
en: %1$lld of %2$lld

# %lld of %lld complete.
source: 已完成 %lld/%lld。
en: %lld of %lld complete.

# %lld of %lld complete. %@
source: %1$lld/%2$lld 已完成。%3$@
en: %1$lld of %2$lld complete. %3$@

# %lld selected
source: 已选择 %lld
en: %lld selected

# %lld shown
source: 显示 %lld 个
en: %lld shown

# %lld skill(s)
source: %lld 个技能
en: %lld skill(s)

# %lld stars
source: %lld 星标
en: %lld stars

# %lld target%@
source: %1$lld 个目标%2$@
en: %1$lld target%2$@

# %lld valid · %lld observed
source: %1$lld 个有效 · 已观察 %2$lld
en: %1$lld valid · %2$lld observed

# %lld valid · %lld observed candidate(s)
source: %1$lld 个有效 · 已观察 %2$lld 个候选项
en: %1$lld valid · %2$lld observed candidate(s)

# +%lld verified alias locations
source: +%lld 个已验证别名位置
en: +%lld verified alias locations

# 0 of %lld complete.
source: 已完成 0/%lld。
en: 0 of %lld complete.

# A Copy target changed in a way that cannot be updated safely.
source: 副本目标发生了无法安全更新的变化。
en: A Copy target changed in a way that cannot be updated safely.

# A backup is ready, but the update did not start. Recheck first.
source: 备份已就绪，但更新尚未开始。请先重新检查。
en: A backup is ready, but the update did not start. Recheck first.

# A batch import is already running.
source: 批量导入已在进行中。
en: A batch import is already running.

# A batch update is already running.
source: 批量更新已在运行。
en: A batch update is already running.

# A blocking library diagnostic prevents changes.
source: 托管库诊断阻止了更改。
en: A blocking library diagnostic prevents changes.

# A deletion operation is already in progress.
source: 删除操作已在进行中。
en: A deletion operation is already in progress.

# A deletion operation is still in progress.
source: 删除操作仍在进行中。
en: A deletion operation is still in progress.

# A distribution operation is already in progress for this Skill.
source: 此 Skill 的分发操作已在进行中。
en: A distribution operation is already in progress for this Skill.

# A local origin is already used and was not restored.
source: 本地来源已被使用，未恢复。
en: A local origin is already used and was not restored.

# A local-origin record will be added to the matched Skill
source: 将向匹配的 Skill 添加本地来源记录
en: A local-origin record will be added to the matched Skill

# A provider alias is already used and was not restored.
source: 提供商别名已被使用，未恢复。
en: A provider alias is already used and was not restored.

# A required distribution target is unavailable.
source: 所需的分发目标不可用。
en: A required distribution target is unavailable.

# A saved link is missing.
source: 保存的链接缺失。
en: A saved link is missing.

# About Skills Manager
source: 关于 Skills Manager
en: About Skills Manager

# Action
source: 操作
en: Action

# Action for %@
source: %@ 的操作
en: Action for %@

# Actions
source: 操作
en: Actions

# Active filters: %@
source: 当前筛选：%@
en: Active filters: %@

# Actual scan roots
source: 实际扫描根目录
en: Actual scan roots

# Adapter
source: 适配器
en: Adapter

# Add
source: 添加
en: Add

# Add %@ to the managed library or safely update it.
source: 将 %@ 添加到托管库，或安全地更新它。
en: Add %@ to the managed library or safely update it.

# Add Custom Path...
source: 添加自定义路径…
en: Add Custom Path...

# Add Custom Skill Path
source: 添加自定义 Skill 路径
en: Add Custom Skill Path

# Add Repository
source: 添加仓库
en: Add Repository

# Add a public repository to discover its Skills.
source: 添加公开仓库以发现其中的 Skill。
en: Add a public repository to discover its Skills.

# Add without enabling
source: 添加但不启用
en: Add without enabling

# Affected items
source: 受影响项目
en: Affected items

# Agent bindings
source: Agent 绑定
en: Agent bindings

# Agent selection has unapplied changes
source: Agent 选择有未应用的更改
en: Agent selection has unapplied changes

# Agent selection has unapplied changes.
source: Agent 选择有未应用的更改。
en: Agent selection has unapplied changes.

# Agent-specific
source: Agent 专属
en: Agent-specific

# Agents
source: Agent
en: Agents

# Agents use the managed Skill directly.
source: Agent 直接使用托管 Skill。
en: Agents use the managed Skill directly.

# Agents: %@
source: Agent：%@
en: Agents: %@

# All
source: 全部
en: All

# All Agents
source: 所有 Agent
en: All Agents

# All Skills
source: 所有技能
en: All Skills

# All Sources
source: 所有来源
en: All Sources

# All Statuses
source: 所有状态
en: All Statuses

# All compatible Agents
source: 所有兼容的 Agent
en: All compatible Agents

# All skills will be added automatically.
source: 所有 Skill 将自动添加。
en: All skills will be added automatically.

# Already managed
source: 已托管
en: Already managed

# Already up to date
source: 已是最新
en: Already up to date

# Also restore the original Agent targets
source: 同时恢复原始 Agent 目标
en: Also restore the original Agent targets

# An Agent-specific target is unavailable.
source: Agent 专属目标不可用。
en: An Agent-specific target is unavailable.

# An equivalent Skill name already exists in the target directory.
source: 目标目录中已存在同名 Skill。
en: An equivalent Skill name already exists in the target directory.

# An independent local Fork was created.
source: 已创建独立的本地 Fork。
en: An independent local Fork was created.

# An unmanaged item already exists at this target.
source: 此目标已有未托管项目。
en: An unmanaged item already exists at this target.

# Another file or directory occupies this managed target.
source: 其他文件或目录占用了此托管目标。
en: Another file or directory occupies this managed target.

# Another import operation is already in progress.
source: 另一个导入操作正在进行中。
en: Another import operation is already in progress.

# Another managed Skill already uses this name.
source: 已有其他托管 Skill 使用此名称。
en: Another managed Skill already uses this name.

# Another operation is in progress.
source: 另一个操作正在进行中。
en: Another operation is in progress.

# Apply
source: 应用
en: Apply

# Applying changes…
source: 正在应用更改…
en: Applying changes…

source: 应用此选择将用 Agent 专属目标替换全局目标。
en: Applying this selection will replace the global target with Agent-specific targets.

# Archive
source: 归档
en: Archive

# Associate this local folder with an existing Skill
source: 将此本地文件夹关联到现有 Skill
en: Associate this local folder with an existing Skill

# Audit incomplete
source: 审计未完成
en: Audit incomplete

# Audit summary
source: 审计摘要
en: Audit summary

# Audit unavailable
source: 审计不可用
en: Audit unavailable

# Auditing
source: 正在审计
en: Auditing

# Available
source: 可用
en: Available

# Available action
source: 可用操作
en: Available action

# Available, Repository
source: 可用，仓库
en: Available, Repository

# Available, skills.sh
source: 可用，skills.sh
en: Available, skills.sh

# Back
source: 返回
en: Back

# Back up and migrate
source: 备份并迁移
en: Back up and migrate

# Back up the original directory, then replace it with a managed Symlink.
source: 备份原目录，然后替换为托管 Symlink。
en: Back up the original directory, then replace it with a managed Symlink.

# Backing up, replacing, and refreshing distribution.
source: 正在备份、替换并刷新分发。
en: Backing up, replacing, and refreshing distribution.

# Backs up the Skill, removes managed Agent links, and deletes the managed Skill.
source: 备份 Skill、移除托管 Agent 链接并删除托管 Skill。
en: Backs up the Skill, removes managed Agent links, and deletes the managed Skill.

# Backup
source: 备份
en: Backup

# Backup %@
source: 备份 %@
en: Backup %@

# Backup completed; recheck before trying the update again
source: 备份已完成；再次尝试更新前请重新检查
en: Backup completed; recheck before trying the update again

# Backup: %@
source: 备份：%@
en: Backup: %@

# Backups
source: 备份
en: Backups

# Backups unavailable
source: 备份不可用
en: Backups unavailable

# Based on %@
source: 基于 %@
en: Based on %@

# Batch Import
source: 批量导入
en: Batch Import

# Batch Import discovered Skills
source: 批量导入发现的 Skill
en: Batch Import discovered Skills

# Batch Updates
source: 批量更新
en: Batch Updates

# Batch import finished with failures.
source: 批量导入完成，但有失败项。
en: Batch import finished with failures.

# Batch import finished.
source: 批量导入完成。
en: Batch import finished.

# Batch update summary: %@
source: 批量更新摘要：%@
en: Batch update summary: %@

# Batch updates are unavailable until the managed library is ready.
source: 托管库准备就绪前，批量更新不可用。
en: Batch updates are unavailable until the managed library is ready.

source: 安装前，Skills Manager 会验证唯一的仓库子路径和不可变 GitHub 修订版本。
en: Before installation, Skills Manager verifies a unique repository subpath and immutable GitHub revision.

# Blocked; Skill remains managed
source: 已阻止；Skill 仍保持托管
en: Blocked; Skill remains managed

# Built for Codex and your other agents to manage and inspect skills on your Mac.
source: 为 Codex 及你的其他 Agent 构建，用于在 Mac 上管理和检查 Skill。
en: Built for Codex and your other agents to manage and inspect skills on your Mac.

# By %@
source: 作者 %@
en: By %@

# Cancel
source: 取消
en: Cancel

# Cancel this Skill update
source: 取消此 Skill 更新
en: Cancel this Skill update

# Cancel this update
source: 取消此次更新
en: Cancel this update

# Cancelled
source: 已取消
en: Cancelled

# Candidate source
source: 候选来源
en: Candidate source

# Change distribution mode
source: 更改分发模式
en: Change distribution mode

# Change preview
source: 更改预览
en: Change preview

# Changelog
source: 更新日志
en: Changelog

# Changes cannot be applied
source: 无法应用更改
en: Changes cannot be applied

# Check All
source: 全部检查
en: Check All

# Check again
source: 再次检查
en: Check again

# Check all managed Skills for updates.
source: 检查所有托管 Skill 的更新。
en: Check all managed Skills for updates.

# Check for App Updates…
source: 检查应用更新…
en: Check for App Updates…

# Check for Updates
source: 检查更新
en: Check for Updates

# Check for Updates…
source: 检查更新…
en: Check for Updates…

# Check managed Skills, review every conflict, then update selected items.
source: 检查已管理的 Skill，审查所有冲突，然后更新选定项目。
en: Check managed Skills, review every conflict, then update selected items.

# Checking
source: 正在检查
en: Checking

# Checking ClawHub status…
source: 正在检查 ClawHub 状态…
en: Checking ClawHub status…

# Checking Skills…
source: 正在检查 Skill…
en: Checking Skills…

# Checking for updates
source: 正在检查更新
en: Checking for updates

# Checking for updates…
source: 正在检查更新…
en: Checking for updates…

# Choose Folder...
source: 选择文件夹…
en: Choose Folder...

# Choose a Skill folder or zip, then add it to the managed library.
source: 选择 Skill 文件夹或 ZIP，然后将其添加到托管库。
en: Choose a Skill folder or zip, then add it to the managed library.

# Choose a ZIP archive
source: 选择 ZIP 压缩包
en: Choose a ZIP archive

# Choose a folder containing platform skill directories
source: 选择包含平台 Skill 目录的文件夹
en: Choose a folder containing platform skill directories

# Choose a skills.sh result.
source: 选择一个 skills.sh 结果。
en: Choose a skills.sh result.

# Choose an action
source: 选择操作
en: Choose an action

# Choose an adapter
source: 选择适配器
en: Choose an adapter

# Choose an adapter for this direct Skill collection root.
source: 请为此直接 Skill 集合根目录选择适配器。
en: Choose an adapter for this direct Skill collection root.

# Choose how to handle every modified Copy before updating.
source: 更新前请选择如何处理每个已修改的副本。
en: Choose how to handle every modified Copy before updating.

# Choose how to handle every modified Copy.
source: 选择如何处理每个已修改的 Copy。
en: Choose how to handle every modified Copy.

# Choose…
source: 选择…
en: Choose…

# Claim existing
source: 认领现有项目
en: Claim existing

# Claim, back up and migrate
source: 认领、备份并迁移
en: Claim, back up and migrate

# Claimed; existing bindings preserved
source: 已认领；现有绑定已保留
en: Claimed; existing bindings preserved

# ClawHub Latest Drops
source: ClawHub 最新发布
en: ClawHub Latest Drops

# ClawHub is temporarily unavailable.
source: ClawHub 暂时不可用。
en: ClawHub is temporarily unavailable.

source: ClawHub 已发布此 Skill，但 Skills Manager 无法保存本地发布状态。请刷新后再发布。
en: ClawHub published the Skill, but Skills Manager could not save its local publish state. Refresh before publishing again.

# ClawHub rate limited this request.
source: ClawHub 限制了此请求的频率。
en: ClawHub rate limited this request.

# ClawHub returned an invalid response.
source: ClawHub 返回了无效响应。
en: ClawHub returned an invalid response.

# ClawHub unavailable
source: ClawHub 不可用
en: ClawHub unavailable

# ClawHub unavailable — cached content may be out of date.
source: ClawHub 不可用 — 缓存内容可能已过期。
en: ClawHub unavailable — cached content may be out of date.

# Cleaning up
source: 正在清理
en: Cleaning up

# Cleanup pending
source: 等待清理
en: Cleanup pending

# Clear
source: 清除
en: Clear

# Clear the filter to restore the complete audit.
source: 清除筛选以恢复完整审计。
en: Clear the filter to restore the complete audit.

# Clear the filter to restore the complete batch.
source: 清除筛选以恢复完整批次。
en: Clear the filter to restore the complete batch.

# Close
source: 关闭
en: Close

# Compatible Agents share one managed link in %@.
source: 兼容的 Agent 在 %@ 中共享一个托管链接。
en: Compatible Agents share one managed link in %@.

# Completed
source: 已完成
en: Completed

# Completed and verified by a fresh consistency audit.
source: 已完成，并通过新的完整性审计验证。
en: Completed and verified by a fresh consistency audit.

# Confirm
source: 确认
en: Confirm

# Confirm claim
source: 确认认领
en: Confirm claim

# Confirm import
source: 确认导入
en: Confirm import

# Confirm or repair the managed library before retrying this update.
source: 重试此更新前请确认或修复托管库。
en: Confirm or repair the managed library before retrying this update.

# Confirm or repair the managed library before retrying.
source: 重试前请确认或修复托管库。
en: Confirm or repair the managed library before retrying.

# Confirm update
source: 确认更新
en: Confirm update

# Conflict
source: 冲突
en: Conflict

# Conflicting identity evidence requires import as an independent Skill.
source: 冲突的身份证据需要作为独立技能导入。
en: Conflicting identity evidence requires import as an independent Skill.

# Connect to the internet and try again.
source: 请连接互联网后重试。
en: Connect to the internet and try again.

# Consistency Audit
source: 一致性审计
en: Consistency Audit

# Consistency audit
source: 一致性审计
en: Consistency audit

# Content
source: 内容
en: Content

# Content fingerprint
source: 内容指纹
en: Content fingerprint

# Content fingerprint drift
source: 内容指纹漂移
en: Content fingerprint drift

# Content will be copied into the SSOT and recorded in the database
source: 内容将复制到 SSOT 并记录到数据库
en: Content will be copied into the SSOT and recorded in the database

# Continues the interrupted deletion safely.
source: 安全地继续中断的删除操作。
en: Continues the interrupted deletion safely.

# Continues this journaled deletion operation.
source: 继续此日志记录的删除操作。
en: Continues this journaled deletion operation.

# Copy
source: 复制
en: Copy

# Copy content is behind the managed Skill and needs to be synchronized.
source: 副本内容落后于已管理的 Skill，需要同步。
en: Copy content is behind the managed Skill and needs to be synchronized.

# Copy decision for %@
source: %@ 的副本决策
en: Copy decision for %@

# Copy decision required
source: 需要决定 Copy 处理方式
en: Copy decision required

# Copy decisions were saved, but the parent Skill was not updated.
source: Copy 决定已保存，但父 Skill 未更新。
en: Copy decisions were saved, but the parent Skill was not updated.

# Copy decisions were saved; recheck before updating the parent Skill
source: Copy 决定已保存；更新父 Skill 前请重新检查
en: Copy decisions were saved; recheck before updating the parent Skill

# Copy login command
source: 复制登录命令
en: Copy login command

# Copy target has local changes
source: Copy 目标有本地更改
en: Copy target has local changes

# Corrupt
source: 已损坏
en: Corrupt

# Create managed copy
source: 创建托管 Copy
en: Create managed copy

# Create managed link
source: 创建托管链接
en: Create managed link

# Create target
source: 创建目标
en: Create target

# Created
source: 已创建
en: Created

# Current Agent targets
source: 当前 Agent 目标
en: Current Agent targets

# Current source
source: 当前来源
en: Current source

# Current targets
source: 当前目标
en: Current targets

# Custom
source: 自定义
en: Custom

# Custom Path Options
source: 自定义路径选项
en: Custom Path Options

# Damaged
source: 已损坏
en: Damaged

# Database busy
source: 数据库繁忙
en: Database busy

# Database missing
source: 数据库缺失
en: Database missing

# Database schema mismatch
source: 数据库架构不匹配
en: Database schema mismatch

# Default branch
source: 默认分支
en: Default branch

# Delete
source: 删除
en: Delete

# Delete Skill
source: 删除 Skill
en: Delete Skill

# Delete from Skills Manager?
source: 从 Skills Manager 删除？
en: Delete from Skills Manager?

# Deleting a managed Skill creates a verified backup here.
source: 删除托管 Skill 会在此创建已验证备份。
en: Deleting a managed Skill creates a verified backup here.

# Deletion did not complete. The active Skill was restored to its prior state.
source: 删除未完成。活动 Skill 已恢复到之前的状态。
en: Deletion did not complete. The active Skill was restored to its prior state.

# Deletion operations
source: 删除操作
en: Deletion operations

# Direct Skill collection root
source: 直接 Skill 集合根目录
en: Direct Skill collection root

# Direct collection · %@
source: 直接集合 · %@
en: Direct collection · %@

# Disable missing target
source: 停用缺失目标
en: Disable missing target

# Disabled
source: 已禁用
en: Disabled

# Discard local changes
source: 放弃本地更改
en: Discard local changes

source: Discard 会恢复托管 Skill 且无法撤销。选择 Fork 可独立保留本地内容。
en: Discard restores the managed Skill and cannot be undone. Choose Fork to preserve the local content independently.

# Discover Skills from public GitHub repositories.
source: 从公开 GitHub 仓库发现 Skill。
en: Discover Skills from public GitHub repositories.

# Discovered Skills
source: 已发现的 Skill
en: Discovered Skills

# Discovery
source: 发现
en: Discovery

source: 预览完成前发现结果已更改。请检查最新结果并重试。
en: Discovery changed before the preview completed. Review the latest result and try again.

# Discovery changed. Review the current candidates before importing.
source: 发现结果已更改。请在导入前检查当前候选项。
en: Discovery changed. Review the current candidates before importing.

# Discovery evidence
source: 发现证据
en: Discovery evidence

# Discovery failed
source: 发现失败
en: Discovery failed

# Discovery unavailable
source: 发现不可用
en: Discovery unavailable

# Distributed
source: 已分发
en: Distributed

# Distribution
source: 分发
en: Distribution

# Distribution changed after preview.
source: 预览后分发状态已更改。
en: Distribution changed after preview.

# Distribution completed and the current state was refreshed.
source: 分发已完成，当前状态已刷新。
en: Distribution completed and the current state was refreshed.

# Distribution did not complete.
source: 分发未完成。
en: Distribution did not complete.

# Distribution is blocked. No Skill will be imported until this is resolved.
source: 分发已阻止。解决此问题前不会导入 Skill。
en: Distribution is blocked. No Skill will be imported until this is resolved.

# Distribution is blocked. The Skill can still be added to the managed library.
source: 分发已阻止。仍可将 Skill 添加到托管库。
en: Distribution is blocked. The Skill can still be added to the managed library.

# Distribution is blocked. This Skill will be added without enabling.
source: 分发已阻止。此 Skill 将被添加但不会启用。
en: Distribution is blocked. This Skill will be added without enabling.

# Distribution mode
source: 分发模式
en: Distribution mode

# Distribution needs attention
source: 分发需要关注
en: Distribution needs attention

# Distribution preview
source: 分发预览
en: Distribution preview

# Distribution preview was unavailable.
source: 分发预览不可用。
en: Distribution preview was unavailable.

# Distribution scope
source: 分发范围
en: Distribution scope

# Distribution slug was unavailable.
source: 分发标识不可用。
en: Distribution slug was unavailable.

# Distribution status: %@
source: 分发状态：%@
en: Distribution status: %@

# Done
source: 完成
en: Done

# Downloading and validating…
source: 正在下载并验证…
en: Downloading and validating…

# Each target receives a managed Copy.
source: 每个目标都会收到托管 Copy。
en: Each target receives a managed Copy.

# Enable for
source: 启用范围
en: Enable for

# Enter a public https://github.com/owner/repository URL.
source: 请输入公开的 https://github.com/owner/repository URL。
en: Enter a public https://github.com/owner/repository URL.

# Enter a search query between 2 and 200 characters.
source: 请输入 2 到 200 个字符的搜索查询。
en: Enter a search query between 2 and 200 characters.

# Enter a valid Git branch, tag, or commit reference.
source: 请输入有效的 Git 分支、标签或提交引用。
en: Enter a valid Git branch, tag, or commit reference.

# Every visible result is unavailable. Fix the folders below, then refresh.
source: 所有可见结果均不可用。请修复下方文件夹，然后刷新。
en: Every visible result is unavailable. Fix the folders below, then refresh.

# Existing Agent bindings were preserved.
source: 现有 Agent 绑定已保留。
en: Existing Agent bindings were preserved.

# Explicitly selects this conflict for an independent import.
source: 明确选择此冲突以执行独立导入。
en: Explicitly selects this conflict for an independent import.

# Failed
source: 失败
en: Failed

# Failed: %@
source: 失败：%@
en: Failed: %@

# Files
source: 文件
en: Files

# Filter audit findings
source: 筛选审计发现
en: Filter audit findings

# Filter batch updates
source: 筛选批量更新
en: Filter batch updates

# Findings
source: 发现
en: Findings

# Finishing the current Skill before stopping…
source: 正在完成当前 Skill，然后停止…
en: Finishing the current Skill before stopping…

# Fix permissions
source: 修复权限
en: Fix permissions

# Full Distribution Settings…
source: 完整分发设置…
en: Full Distribution Settings…
